tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "puma/puma"

# Dev tools
brew "diff-so-fancy"
brew "the_silver_searcher"
brew "fzf"
brew "git"
brew "vim", with: "ruby python3" # python is needed for ultisnips.vim
brew "tig"
brew "hub"
brew "tmate"
brew "tmux"
brew "yarn"

# Utils
brew "coreutils"
brew "ctags"
brew "curl"
brew "wget"
brew "pidof"
brew "tree"
brew "gpg" # required for asdf
brew "source-highlight" # for less

# Dev applications
brew "redis"
brew "imagemagick"
brew "puma/puma/puma-dev"
brew "heroku/brew/heroku"
brew "s3cmd"

brew "shpotify"

# Cask apps
cask "karabiner-elements"
cask "ngrok"
cask "font-fira-code"
